In [1]:
import pandas as pd

data = {'Name': ['John', 'Emma', 'Peter', 'Olivia'],
        'Age' : [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'Sydney']}

df = pd.DataFrame(data)

In [2]:
print(df)

     Name  Age      City
0    John   25  New York
1    Emma   30    London
2   Peter   35     Paris
3  Olivia   28    Sydney

In [3]:
df

     Name  Age      City
0    John   25  New York
1    Emma   30    London
2   Peter   35     Paris
3  Olivia   28    Sydney

In [4]:
df.drop([0, 1], axis=0)

     Name  Age    City
2   Peter   35   Paris
3  Olivia   28  Sydney

In [5]:
df

     Name  Age      City
0    John   25  New York
1    Emma   30    London
2   Peter   35     Paris
3  Olivia   28    Sydney

In [6]:
df.drop([0, 1], axis=0, inplace=True) # inplace = True means the change will be permanent in dataset

In [7]:
df

     Name  Age    City
2   Peter   35   Paris
3  Olivia   28  Sydney

In [8]:
data = {'Name': ['John', 'Emma', 'Peter', 'Olivia'],
        'Age' : [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'Sydney']}

df = pd.DataFrame(data)

In [9]:
df

     Name  Age      City
0    John   25  New York
1    Emma   30    London
2   Peter   35     Paris
3  Olivia   28    Sydney

In [10]:
df.drop(['City'], axis=1)

     Name  Age
0    John   25
1    Emma   30
2   Peter   35
3  Olivia   28

In [11]:
df

     Name  Age      City
0    John   25  New York
1    Emma   30    London
2   Peter   35     Paris
3  Olivia   28    Sydney

In [12]:
df.drop(['City'], axis=1, inplace=True)

In [13]:
df

     Name  Age
0    John   25
1    Emma   30
2   Peter   35
3  Olivia   28

In [14]:
data = {'Name': ['John', 'Emma', 'Peter', 'Olivia'],
        'Age' : [25, 30, 35, 28],
        'City': ['New York', 'London', 'Paris', 'Sydney']}

df = pd.DataFrame(data)

In [15]:
df['Country'] = ['USA', 'UK', 'France', 'Australia']

df

     Name  Age      City    Country
0    John   25  New York        USA
1    Emma   30    London         UK
2   Peter   35     Paris     France
3  Olivia   28    Sydney  Australia

In [16]:
df['Age'] = [26, 31, 36, 29]

In [17]:
df

     Name  Age      City    Country
0    John   26  New York        USA
1    Emma   31    London         UK
2   Peter   36     Paris     France
3  Olivia   29    Sydney  Australia

In [18]:
df.loc[0, 'City']='Chicago'

In [19]:
df

     Name  Age     City    Country
0    John   26  Chicago        USA
1    Emma   31   London         UK
2   Peter   36    Paris     France
3  Olivia   29   Sydney  Australia

In [20]:
df.loc[3, 'City'] = 'Melborn'

In [21]:
df

     Name  Age     City    Country
0    John   26  Chicago        USA
1    Emma   31   London         UK
2   Peter   36    Paris     France
3  Olivia   29  Melborn  Australia

In [22]:
age_more_than_30 = df[df['Age'] > 30]

age_more_than_30

    Name  Age    City Country
1   Emma   31  London      UK
2  Peter   36   Paris  France

In [23]:
data = {'Name'  : ['John', 'Emma', 'Peter', 'Olivia'], 
        'Age'   : [25, 30, 35, 28], 
        'Height': [170, 165, 180, 175],
        'Weight': [70, 65, 80, 75]
       }

df = pd.DataFrame(data)

In [24]:
df

     Name  Age  Height  Weight
0    John   25     170      70
1    Emma   30     165      65
2   Peter   35     180      80
3  Olivia   28     175      75

In [25]:
df.min()

Name      Emma
Age         25
Height     165
Weight      65
dtype: object

In [26]:
df.max()

Name      Peter
Age          35
Height      180
Weight       80
dtype: object

In [27]:
mean_value_age = df['Age'].mean()

In [28]:
mean_value_height = df['Height'].mean()
mean_value_weight = df['Weight'].mean()

In [29]:
mean_value_age

29.5

In [30]:
mean_value_height

172.5

In [31]:
mean_value_weight

72.5

In [32]:
df.mean()

C:\Users\arpit\AppData\Local\Temp\ipykernel_16684\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age        29.5
Height    172.5
Weight     72.5
dtype: float64

In [33]:
df['Age'].std()

4.203173404306164

In [34]:
df['Height'].std()

6.454972243679028

In [35]:
df['Weight'].std()

6.454972243679028

In [36]:
df.std()

C:\Users\arpit\AppData\Local\Temp\ipykernel_16684\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Age       4.203173
Height    6.454972
Weight    6.454972
dtype: float64

In [37]:
data = {'Name'  : ['John', 'Emma', 'Peter', 'Olivia'], 
        'Age'   : [25, 30, 35, 28], 
        'Height': [170, 165, 180, 175],
        'Weight': [70, 65, 80, 75]
       }

df = pd.DataFrame(data)
df[['Age', 'Height', 'Weight']]

   Age  Height  Weight
0   25     170      70
1   30     165      65
2   35     180      80
3   28     175      75

In [38]:
def half(s):
    return s * 0.5

In [39]:
df[['Age', 'Height', 'Weight']].apply(half)

    Age  Height  Weight
0  12.5    85.0    35.0
1  15.0    82.5    32.5
2  17.5    90.0    40.0
3  14.0    87.5    37.5

### BAD DATA:

- Bad data typically refers to data that is inaccurate, incomplete, inconsistent, or outdated.

- For Data Cleaning we mainly focus on these 4 points:
     1. Empty data, Empty cells or missing value:
         - Imputation or filling those data.
         - Drop that cells or rows
    2. Data in wrong format.
    3. wrong Data
    4. Data Redundancy or Duplicates

#### 1. Missing data

In [40]:
import numpy as np
import pandas as pd

In [41]:
df = pd.DataFrame({'name': ['Alfred', 'Batman', 'Catwoman'],
                   'toy' : [np.nan, 'Batmobile', 'Bullwhip'],
                   'born': [pd.NaT, pd.Timestamp("1940-04-25"), 
                           pd.NaT]})

print(df)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [43]:
df = df.dropna() # Drop NaN or NaT or missing values

In [44]:
df

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [45]:
df = pd.DataFrame({'name': ['Alfred', 'Batman', 'Catwoman'],
                   'toy' : [np.nan, 'Batmobile', 'Bullwhip'],
                   'born': [pd.NaT, pd.Timestamp("1940-04-25"), 
                           pd.NaT]})

print(df)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [46]:
df.fillna(130, inplace=True) # Example to fill some data in place of missing values, NaN, NaT
df

       name        toy                 born
0    Alfred        130                  130
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                  130

In [47]:
df = pd.DataFrame({'name': ['Alfred', pd.NA, 'Catwoman'],
                   'toy' : [np.nan, 'Batmobile', 'Bullwhip'],
                   'born': [pd.NaT, pd.Timestamp("1940-04-25"), 
                           pd.NaT]})

print(df)

       name        toy       born
0    Alfred        NaN        NaT
1      <NA>  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [48]:
df['name'].fillna("Batman", inplace=True)

In [49]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [50]:
df = pd.DataFrame({'item': ['milk', 'sugar', 'chips', 'coffee'],
                   'quantity': [2, 1, 5, 4],
                   'price': [67, pd.NA, 45, 73]})

df

     item  quantity price
0    milk         2    67
1   sugar         1  <NA>
2   chips         5    45
3  coffee         4    73

In [51]:
df['price'] = df['price'].fillna(df['price'].mean())

In [52]:
df

     item  quantity      price
0    milk         2  67.000000
1   sugar         1  61.666667
2   chips         5  45.000000
3  coffee         4  73.000000

In [53]:
df = pd.DataFrame({'item': ['milk', 'sugar', 'chips', 'coffee'],
                   'quantity': [2, 1, 5, 4],
                   'price': [67, pd.NA, 45, 73]})

df

     item  quantity price
0    milk         2    67
1   sugar         1  <NA>
2   chips         5    45
3  coffee         4    73

In [54]:
df['price'] = df['price'].fillna(df['price'].median())

In [55]:
df

     item  quantity  price
0    milk         2   67.0
1   sugar         1   67.0
2   chips         5   45.0
3  coffee         4   73.0

#### 2. Data in Wrong Format

In [56]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Duration": [60, 60, 60, 45, 45, 60, 60, 450, 30, 60, 60],
    "Pulse": [110, 117, 103, 109, 117, 102, 104, 109, 98, 100, 100],
    "Calories": [409.1, 479.0, 340.0, 282.4, 406.0, 300.0, 374.0, 253.3, 195.1, 269.0, 269.0],
    "Date": ["2020/12/01", "2020/12/02", "20201203", "2020/12/04", "2020/12/05", pd.NA, "2020/12/07", "2020/12/08", "2020/12/09", "2020/12/10", "2020/12/10"]
})

df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0    20201203
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        450    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [57]:
df['Date'] = pd.to_datetime(df['Date'])

print(df)

    Duration  Pulse  Calories       Date
0         60    110     409.1 2020-12-01
1         60    117     479.0 2020-12-02
2         60    103     340.0 2020-12-03
3         45    109     282.4 2020-12-04
4         45    117     406.0 2020-12-05
5         60    102     300.0        NaT
6         60    104     374.0 2020-12-07
7        450    109     253.3 2020-12-08
8         30     98     195.1 2020-12-09
9         60    100     269.0 2020-12-10
10        60    100     269.0 2020-12-10

#### 3.  Wrong Data

In [58]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Duration": [60, 60, 60, 45, 45, 60, 60, 450, 30, 60, 60],
    "Pulse": [110, 117, 103, 109, 117, 102, 104, 109, 98, 100, 100],
    "Calories": [409.1, 479.0, 340.0, 282.4, 406.0, 300.0, 374.0, 253.3, 195.1, 269.0, 269.0],
    "Date": ["2020/12/01", "2020/12/02", "2020/12/03", "2020/12/04", "2020/12/05", pd.NA, "2020/12/07", "2020/12/08", "2020/12/09", "2020/12/10", "2020/12/10"]
})

df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        450    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

- **450** in Duration column is a wrong data! because duration will not exceed 120

In [59]:
df.loc[7, 'Duration'] = 45

df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7         45    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [60]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Duration": [60, 60, 60, 45, 45, 60, 60, 450, 30, 60, 60],
    "Pulse": [110, 117, 103, 109, 117, 102, 104, 109, 98, 100, 100],
    "Calories": [409.1, 479.0, 340.0, 282.4, 406.0, 300.0, 374.0, 253.3, 195.1, 269.0, 269.0],
    "Date": ["2020/12/01", "2020/12/02", "2020/12/03", "2020/12/04", "2020/12/05", pd.NA, "2020/12/07", "2020/12/08", "2020/12/09", "2020/12/10", "2020/12/10"]
})

df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        450    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [61]:
for x in df.index:
    if df.loc[x, 'Duration'] > 120:
        df.loc[x, 'Duration'] = 120

In [62]:
df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        120    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [63]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Duration": [60, 60, 60, 45, 45, 60, 60, 450, 30, 60, 60],
    "Pulse": [110, 117, 103, 109, 117, 102, 104, 109, 98, 100, 100],
    "Calories": [409.1, 479.0, 340.0, 282.4, 406.0, 300.0, 374.0, 253.3, 195.1, 269.0, 269.0],
    "Date": ["2020/12/01", "2020/12/02", "2020/12/03", "2020/12/04", "2020/12/05", pd.NA, "2020/12/07", "2020/12/08", "2020/12/09", "2020/12/10", "2020/12/10"]
})

df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        450    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [64]:
for x in df.index:
    if df.loc[x, 'Duration'] > 120:
        df.loc[x, 'Duration'] = df['Duration'].median()

In [65]:
df

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0  2020/12/03
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7         60    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

#### 4. Duplicates

In [66]:
print(df.duplicated())

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [67]:
df.drop_duplicates(inplace=True)

In [68]:
df

   Duration  Pulse  Calories        Date
0        60    110     409.1  2020/12/01
1        60    117     479.0  2020/12/02
2        60    103     340.0  2020/12/03
3        45    109     282.4  2020/12/04
4        45    117     406.0  2020/12/05
5        60    102     300.0        <NA>
6        60    104     374.0  2020/12/07
7        60    109     253.3  2020/12/08
8        30     98     195.1  2020/12/09
9        60    100     269.0  2020/12/10